# Missing Values

The real-world data often has a lot of missing values. If you want your model to work unbiased and accurately then you just can’t ignore the part of “missing value” in your data. One of the most common problems faced in data cleansing or preprocessing is handling missing values.

## Identifying Missing Values

In [ ]:
import pandas as pd
import numpy as np

# Example DataFrame with missing values 
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, np.nan, 5],
    'C': [1, 2, 3, 4, np.nan]
}
df = pd.DataFrame(data)

# Identify missing values
print("Original DataFrame:\n", df)
print("\nMissing values (True indicates missing):\n", df.isna())
print("\nNumber of missing values per column:\n", df.isna().sum())

## Delete Rows with Missing Values

In [ ]:
print(data.isnull().sum())
print(data.shape)

In [ ]:
data.dropna(inplace=True)
print(data.isnull().sum())
print(data.shape)

In [ ]:
# Deleting Enrire Row
df = train_df.dropna(axis=0)
df.isnull().sum()

In [ ]:
# Deleting the entire column
df = train_df.drop(['Dependents'],axis=1)
df.isnull().sum()

In [ ]:

# Remove rows where all values are missing
df_drop_all = df.dropna(how='all')
print("\nDataFrame after dropping rows where all values are missing:\n", df_drop_all)

In [ ]:
# Remove rows with a threshold of missing values (e.g., at least 2 non-NA values)
df_drop_thresh = df.dropna(thresh=2)
print("\nDataFrame after dropping rows with less than 2 non-NA values:\n", df_drop_thresh)

## Replacing with an arbitrary value

In [ ]:
#Replace the missingvaluewith '0'using 'fiilna'method
train_df['Dependents'] = train_df['Dependents'].fillna(0)
train_df[‘Dependents'].isnull().sum()

## Impute missing values with Mean/Median

In [ ]:
#Replace the missing values for numerical columns with mean
train_df['LoanAmount'] = train_df['LoanAmount'].fillna(train_df['LoanAmount'].mean())
train_df['Credit_History'] = train_df[‘Credit_History'].fillna(train_df['Credit_History'].mean())

In [ ]:
#Replace the missing values for categorical columns with mode
train_df['Gender'] = train_df['Gender'].fillna(train_df['Gender'].mode()[0])
train_df['Married'] = train_df['Married'].fillna(train_df['Married'].mode()[0])
train_df['Self_Employed'] = train_df[‘Self_Employed'].fillna(train_df['Self_Employed'].mode()[0])
train_df.isnull().sum()

In [ ]:
# Replacing with the median
train_df['Loan_Amount_Term']= train_df['Loan_Amount_Term'].fillna(train_df['Loan_Amount_Term'].median())

## Replacing with the previous value – forward fill

In [ ]:
import pandasas pd
import numpyas np

test = pd.Series(range(6))
test.loc[2:4] = np.nan

test

In [ ]:
test.fillna(method=‘ffill')

## Replacing with the next value – backward fill

In [ ]:
test.fillna(method=‘bfill')

## All With lambda

In [ ]:
# Fill missing values with a constant value
df_fill_constant = df.fillna(0)
print("\nDataFrame after filling missing values with 0:\n", df_fill_constant)

# Fill missing values with the mean of the column
df_fill_mean = df.apply(lambda x: x.fillna(x.mean()), axis=0)
print("\nDataFrame after filling missing values with column mean:\n", df_fill_mean)

# Fill missing values with the median of the column
df_fill_median = df.apply(lambda x: x.fillna(x.median()), axis=0)
print("\nDataFrame after filling missing values with column median:\n", df_fill_median)

# Fill missing values with the mode of the column
df_fill_mode = df.apply(lambda x: x.fillna(x.mode()[0]), axis=0)
print("\nDataFrame after filling missing values with column mode:\n", df_fill_mode)

## Interpolation

Missing values can also be imputed using interpolation. Pandas’ interpolate method can be used to replace the missing values with different interpolation methods like ‘polynomial,’ ‘linear,’ and ‘quadratic.’ The default method is ‘linear.’

In [ ]:
test.interpolate()

## Imputation method for categorical columns

In [ ]:
import pandasas pd
import numpyas np
X = pd.DataFrame({'Shape':['square', 'square', 'oval', 'circle', np.nan]})
X
Shape

In [ ]:

from sklearn.imputeimport SimpleImputer
imputer = SimpleImputer(strategy='most_frequent')
imputer.fit_transform(X)

In [ ]:
imputer = SimpleImputer(strategy='constant', fill_value='missing')
imputer.fit_transform(X)

## Imputation Methods for numbers in SK-Learn

In [ ]:
# Taking care of missing data
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(missing_values=np.nan, strategy='mean')
imputer.fit(X[:, 1:3])
X[:, 1:3] = imputer.transform(X[:, 1:3]) # Replacing new data
print(X)

## Using Algorithms that support missing values

All the machine learning algorithms don’t support missing values but some ML algorithms are robust to missing values in the dataset. The k-NN algorithm can ignore a column from a distance measure when a value is missing. Naive Bayes can also support missing values when making a prediction. These algorithms can be used when the dataset contains null or missing values.

The sklearn implementations of naive Bayes and k-Nearest Neighbors in Python do not support the presence of the missing values.

Another algorithm that can be used here is RandomForest that works well on non-linear and categorical data. It adapts to the data structure taking into consideration the high variance or the bias, producing better results on large datasets.

**Pros:**

- No need to handle missing values in each column as ML algorithms will handle them efficiently.

**Cons:**

- No implementation of these ML algorithms in the scikit-learn library.

## Prediction of missing values:

In [ ]:
# Here 'Age' column contains missing values so for prediction of 
# null values the spliting of data will be,

y_train: rows from data["Age"] with non null values
y_test: rows from data["Age"] with null values
X_train: Dataset except data["Age"] features with non null values
X_test: Dataset except data["Age"] features with null values

In [ ]:
from sklearn.linear_model import LinearRegression
import pandas as pd

data = pd.read_csv("train.csv")
data = data[["Survived", "Pclass", "Sex", "SibSp", "Parch", "Fare", "Age"]]

data["Sex"] = [1 if x=="male" else 0 for x in data["Sex"]]

test_data = data[data["Age"].isnull()]
data.dropna(inplace=True)

y_train = data["Age"]
X_train = data.drop("Age", axis=1)
X_test = test_data.drop("Age", axis=1)

model = LinearRegression()
model.fit(X_train, y_train)

y_pred = model.predict(X_test)

**Pros:**

- Gives a better result than earlier methods
- Takes into account the covariance between the missing value column and other columns.

**Cons:**

- Considered only as a proxy for the true values

## Imputation using Deep Learning Library — Datawig

This method works very well with categorical, continuous, and non-numerical features. Datawig is a library that learns ML models using Deep Neural Networks to impute missing values in the datagram.

`Install datawig library,
pip3 install datawig`

Datawig can take a data frame and fit an imputation model for each column with missing values, with all other columns as inputs.

In [ ]:
import pandas as pd
pip install datawig
import datawig

data = pd.read_csv("train.csv")

df_train, df_test = datawig.utils.random_split(data)

#Initialize a SimpleImputer model
imputer = datawig.SimpleImputer(
    input_columns=['Pclass','SibSp','Parch'], # column(s) containing information about the column we want to impute
    output_column= 'Age', # the column we'd like to impute values for
    output_path = 'imputer_model' # stores model data and metrics
    )

#Fit an imputer model on the train data
imputer.fit(train_df=df_train, num_epochs=50)

#Impute missing values and return original dataframe with predictions
imputed = imputer.predict(df_test)

**Pros**:

- Quite accurate compared to other methods.
- It supports CPUs and GPUs.

**Cons:**

- Can be quite slow with large datasets.

## Nearest Neighbors Imputations (KNNImputer)

Missing values are imputed using the k-Nearest Neighbors approach, where a Euclidean distance is used to find the nearest neighbors.

In [ ]:
from sklearn.imputeimport KNNImputer
impute_knn = KNNImputer(n_neighbors=2)
impute_knn.fit_transform(X)

## Handling Missing Value Project Example

In [11]:
import pandas as pd
import numpy as np

In [12]:
df = pd.DataFrame({"name":["William","Emma","Sofia","Markus","Edward","Thomas","Ethan","Olivia","Arun","Anika","Paulo"]
,"region":["East",np.nan,"East","South","West","West","South","West","West","East","South"]
,"sales":[50000,52000,90000,np.nan,42000,72000,49000,np.nan,67000,65000,67000]
,"expenses":[42000,43000,np.nan,44000,38000,39000,42000,np.nan,39000,44000,45000]
,"lossValues":[12000,'?','?',np.nan,11000,33000,44000,10000,22000,30000,99000]})

df

       name region    sales  expenses lossValues
0   William   East  50000.0   42000.0      12000
1      Emma    NaN  52000.0   43000.0          ?
2     Sofia   East  90000.0       NaN          ?
3    Markus  South      NaN   44000.0        NaN
4    Edward   West  42000.0   38000.0      11000
5    Thomas   West  72000.0   39000.0      33000
6     Ethan  South  49000.0   42000.0      44000
7    Olivia   West      NaN       NaN      10000
8      Arun   West  67000.0   39000.0      22000
9     Anika   East  65000.0   44000.0      30000
10    Paulo  South  67000.0   45000.0      99000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        11 non-null     object
 1   region      10 non-null     object
 2   sales       9 non-null      float64
 3   expenses    9 non-null      float64
 4   lossValues  10 non-null     object
dtypes: float64(2), object(3)
memory usage: 572.0+ bytes

In [14]:
df.isnull()

     name  region  sales  expenses  lossValues
0   False   False  False     False       False
1   False    True  False     False       False
2   False   False  False      True       False
3   False   False   True     False        True
4   False   False  False     False       False
5   False   False  False     False       False
6   False   False  False     False       False
7   False   False   True      True       False
8   False   False  False     False       False
9   False   False  False     False       False
10  False   False  False     False       False

In [15]:
df.isnull().any()

name          False
region         True
sales          True
expenses       True
lossValues     True
dtype: bool

In [16]:
df.isnull().sum()

name          0
region        1
sales         2
expenses      2
lossValues    1
dtype: int64

In [17]:
df.replace(to_replace ='?', value = np.nan, inplace = True)

C:\Users\Agent47\AppData\Local\Temp\ipykernel_8224\960218073.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.replace(to_replace ='?', value = np.nan, inplace = True)

In [18]:
df

       name region    sales  expenses  lossValues
0   William   East  50000.0   42000.0     12000.0
1      Emma    NaN  52000.0   43000.0         NaN
2     Sofia   East  90000.0       NaN         NaN
3    Markus  South      NaN   44000.0         NaN
4    Edward   West  42000.0   38000.0     11000.0
5    Thomas   West  72000.0   39000.0     33000.0
6     Ethan  South  49000.0   42000.0     44000.0
7    Olivia   West      NaN       NaN     10000.0
8      Arun   West  67000.0   39000.0     22000.0
9     Anika   East  65000.0   44000.0     30000.0
10    Paulo  South  67000.0   45000.0     99000.0

In [19]:
df1 = df.copy()
df1

       name region    sales  expenses  lossValues
0   William   East  50000.0   42000.0     12000.0
1      Emma    NaN  52000.0   43000.0         NaN
2     Sofia   East  90000.0       NaN         NaN
3    Markus  South      NaN   44000.0         NaN
4    Edward   West  42000.0   38000.0     11000.0
5    Thomas   West  72000.0   39000.0     33000.0
6     Ethan  South  49000.0   42000.0     44000.0
7    Olivia   West      NaN       NaN     10000.0
8      Arun   West  67000.0   39000.0     22000.0
9     Anika   East  65000.0   44000.0     30000.0
10    Paulo  South  67000.0   45000.0     99000.0

In [20]:
df1.fillna(10000)

       name region    sales  expenses  lossValues
0   William   East  50000.0   42000.0     12000.0
1      Emma  10000  52000.0   43000.0     10000.0
2     Sofia   East  90000.0   10000.0     10000.0
3    Markus  South  10000.0   44000.0     10000.0
4    Edward   West  42000.0   38000.0     11000.0
5    Thomas   West  72000.0   39000.0     33000.0
6     Ethan  South  49000.0   42000.0     44000.0
7    Olivia   West  10000.0   10000.0     10000.0
8      Arun   West  67000.0   39000.0     22000.0
9     Anika   East  65000.0   44000.0     30000.0
10    Paulo  South  67000.0   45000.0     99000.0

In [21]:
df1

       name region    sales  expenses  lossValues
0   William   East  50000.0   42000.0     12000.0
1      Emma    NaN  52000.0   43000.0         NaN
2     Sofia   East  90000.0       NaN         NaN
3    Markus  South      NaN   44000.0         NaN
4    Edward   West  42000.0   38000.0     11000.0
5    Thomas   West  72000.0   39000.0     33000.0
6     Ethan  South  49000.0   42000.0     44000.0
7    Olivia   West      NaN       NaN     10000.0
8      Arun   West  67000.0   39000.0     22000.0
9     Anika   East  65000.0   44000.0     30000.0
10    Paulo  South  67000.0   45000.0     99000.0

In [22]:
df1['region'].fillna(value = 'NEWS',inplace = True)

C:\Users\Agent47\AppData\Local\Temp\ipykernel_8224\850146590.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df1['region'].fillna(value = 'NEWS',inplace = True)

In [23]:
df1.fillna(value = {'sales' : df1['sales'].mean(), 'expenses' : df1['expenses'].median(), 'lossValues' : df1['lossValues'].std()}, inplace = True )

In [24]:
df1

       name region         sales  expenses    lossValues
0   William   East  50000.000000   42000.0  12000.000000
1      Emma   NEWS  52000.000000   43000.0  29422.719598
2     Sofia   East  90000.000000   42000.0  29422.719598
3    Markus  South  61555.555556   44000.0  29422.719598
4    Edward   West  42000.000000   38000.0  11000.000000
5    Thomas   West  72000.000000   39000.0  33000.000000
6     Ethan  South  49000.000000   42000.0  44000.000000
7    Olivia   West  61555.555556   42000.0  10000.000000
8      Arun   West  67000.000000   39000.0  22000.000000
9     Anika   East  65000.000000   44000.0  30000.000000
10    Paulo  South  67000.000000   45000.0  99000.000000